app/views/ads/_form.html.erb

  <div class="field">
    <%= f.label :organization_id %>    <%= f.collection_select( :organization_id, Organization.all, :id, :name ) %>
---
SELECT "organizations".* FROM "organizations"