app/views/insertions/_form.html.erb

SELECT "magazines".* FROM "magazines"
---
    <%= f.label :magazine_id %><br>
    <%= f.collection_select( :magazine_id, Magazine.all, :id, :title ) %>