app/views/articles/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :editor %><br>
    <%= f.collection_select( :editor, User.all, :id, :email ) %>