app/views/pages/home.html.erb

SELECT "magazines".* FROM "magazines"
---
          <h2>Editor Articles</h2><br />
  <% Magazine.all.each do |m| %>

SELECT "articles".* FROM "articles"
---
  			<h5><%= i.title %></h5>
  <% i.articles.each do |e| %>