app/views/contacts/_form.html.erb

    <%= f.label :organization_id %><br>
    <%= f.collection_select( :organization_id, Organization.all, :id, :name ) %>
---
SELECT "organizations".* FROM "organizations"