app/controllers/articles_controller.rb

  def index
    @magazine = Magazine.find(params[:magazine_id])
    @issue = @magazine.issues.find(params[:issue_id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "issues".* FROM "issues" WHERE "issues"."magazine_id" = ? AND "issues"."id" = ? LIMIT 1  [["magazine_id", 4], ["id", 14]]

  def show
  a = @article.editor
  @editor = User.find(a)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def new
    @mag = Magazine.find(params[:magazine_id])
    @issue = @mag.issues.find(params[:issue_id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "issues".* FROM "issues" WHERE "issues"."magazine_id" = ? AND "issues"."id" = ? LIMIT 1  [["magazine_id", 4], ["id", 14]]

  def edit
        #1st you retrieve the post thanks to params[:post_id]
    magazine = Magazine.find(params[:magazine_id])
    issue = magazine.issues.find(params[:issue_id])
    #2nd you retrieve the comment thanks to params[:id]
    @article = issue.articles.find(params[:id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "issues".* FROM "issues" WHERE "issues"."magazine_id" = ? AND "issues"."id" = ? LIMIT 1  [["magazine_id", 4], ["id", 14]]
SELECT  "articles".* FROM "articles" WHERE "articles"."issue_id" = ? AND "articles"."id" = ? LIMIT 1  [["issue_id", 14], ["id", 2]]

  def create
    magazine = Magazine.find(params[:magazine_id])
     issue = magazine.issues.find(params[:issue_id])
      @article = issue.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "issues".* FROM "issues" WHERE "issues"."magazine_id" = ? AND "issues"."id" = ? LIMIT 1  [["magazine_id", 4], ["id", 14]]
INSERT INTO "articles" ("title", "content", "description", "copy", "photo", "print", "editor", "issue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "editor" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["editor", 1], ["updated_at", "2015-05-13 03:54:46.333951"], ["id", 2]]