app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "phone", "email", "title", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "organization_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["organization_id", 1], ["updated_at", "2015-05-12 22:55:36.963357"], ["id", 1]]