app/controllers/insertions_controller.rb

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
  m = @insertion.magazine_id
  @mag = Magazine.find(m)

INSERT INTO "insertions" ("price", "magazine_id", "ad_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 500], ["magazine_id", 7], ["ad_id", 1], ["created_at", "2015-05-15 05:09:23.315781"], ["updated_at", "2015-05-15 05:09:23.315781"]]
---
  def create
    ad = Ad.find(params[:ad_id])
    @insertion = ad.insertions.build(insertion_params)

SELECT  "insertions".* FROM "insertions" WHERE "insertions"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_insertion
      ad = Ad.find(params[:ad_id])
      @insertion = Insertion.find(params[:id])