app/controllers/issues_controller.rb

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @magazine = Magazine.find(params[:magazine_id])

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @mag = Magazine.find(params[:magazine_id])

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "issues".* FROM "issues" WHERE "issues"."magazine_id" = ? AND "issues"."id" = ? LIMIT 1  [["magazine_id", 3], ["id", 12]]
---
  def edit
    #1st you retrieve the post thanks to params[:post_id]
    magazine = Magazine.find(params[:magazine_id])
    #2nd you retrieve the comment thanks to params[:id]
    @issue = magazine.issues.find(params[:id])

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "issues" ("title", "printdate", "magazine_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test 5"], ["printdate", "2015-05-10"], ["magazine_id", 1], ["created_at", "2015-05-08 00:26:43.472243"], ["updated_at", "2015-05-08 00:26:43.472243"]]
---
  def create

    magazine = Magazine.find(params[:magazine_id])
    @issue = magazine.issues.build(issue_params)

    respond_to do |format|
      if @issue.save

UPDATE "issues" SET "printdate" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["printdate", "2015-06-13"], ["updated_at", "2015-05-11 20:38:41.746211"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @issue.update(issue_params)

DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 12]]
---
  def destroy
    @issue.destroy

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "issues".* FROM "issues" WHERE "issues"."magazine_id" = ? AND "issues"."id" = ? LIMIT 1  [["magazine_id", 3], ["id", 12]]
---
    def set_issue
      magazine = Magazine.find(params[:magazine_id])
      @issue = magazine.issues.find(params[:id])

SELECT "magazines".* FROM "magazines"
---
    def set_magazines
    @magazines = Magazine.all