app/controllers/magazines_controller.rb

SELECT "magazines".* FROM "magazines"
---
  def index
    @magazines = Magazine.all

INSERT INTO "magazines" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "92127 Magazine"], ["created_at", "2015-05-07 22:01:30.324337"], ["updated_at", "2015-05-07 22:01:30.324337"]]
---
  def create
    @magazine = Magazine.new(magazine_params)

    respond_to do |format|
      if @magazine.save

DELETE FROM "magazines" WHERE "magazines"."id" = ?  [["id", 1]]
---
  def destroy
    @magazine.destroy

SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_magazine
      @magazine = Magazine.find(params[:id])

SELECT "magazines".* FROM "magazines"
---
    def set_magazines
    @magazines = Magazine.all