app/controllers/organizations_controller.rb

  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save
---
INSERT INTO "organizations" ("name", "address", "city", "state", "zip", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)