app/views/organizations/show.html.erb

  <strong>Contacts:</strong>
  <% @organization.contacts.each do |c| %>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."organization_id" = ?  [["organization_id", 1]]